{
  "id": "google-blogs",
  "title": "Google Blogs",
  "author": "Vladimir Dietrich",
  "date": "2025-06-14",
  "readingTime": 3,
  "heroImage": {
    "fileName": "google-blogs-image-0.png",
    "githubPath": "images/google-blogs-image-0.png",
    "githubUrl": "https://raw.githubusercontent.com/vladimirbrasil/vladidevprojects/main/images/google-blogs-image-0.png",
    "altText": "",
    "caption": ""
  },
  "lastUpdated": "2025-07-05T07:38:43.027Z",
  "wordCount": 557,
  "content": "<p>   </p>\n<p></p>\n<p>Imagine um Google Doc. Pronto: temos mais um entrada para um blog. “Google Blogs”!</p>\n<p>A ideia deste projeto foi facilitar a manutenção de um blog.</p>\n<p>Primeiro pensei qual a maneira mais fácil de gerar conteúdo?</p>\n<figure><img src=\"https://raw.githubusercontent.com/vladimirbrasil/vladidevprojects/main/images/google-blogs-image-1.jpg\" alt=\"\" /></figure>\n<p>Bem, em primeiríssimo lugar aparecem as redes sociais e até mesmo sites especializados como o <a href=\"https://medium.com/\" target=\"_blank\" rel=\"noopener noreferrer\">Medium</a>. Mas pouco a pouco estas primeiras opções foram inventando restrições: primeiro, o Medium começou a cobrar por postagens; após, facebook e instagram começaram a impedir textos muito longos.</p>\n<p>Então precisei reformular a pergunta: qual a maneira mais fácil de gerar conteúdo com bastante liberdade?</p>\n<p>Aqui o Google Docs se destaca. Ele foi desenhando e é mantido para ser uma das maneiras mais práticas e fáceis de gerar conteúdo. Posso ditar o texto pelo celular, por exemplo. Pronto: tenho mais um Google Doc. Se surgirem novas tecnologias, é provável que o Google Docs absorva esta nova maneira de gerar conteúdo.</p>\n<p>Sendo assim. Será que posso conectar um blog a Google Docs?</p>\n<p>Surgiu o projeto Google Blogs.</p>\n<p>Como funciona?</p>\n<p>Funciona assim: é criada uma pasta no Google Drive do blogueiro. Por exemplo: “Meu Blog” - qualquer nome serve. Qualquer Google Doc criado nesta pasta passa a ser uma entrada do blog.</p>\n<p>Atualmente, imagens, títulos, links, itálicos, negritos e muitas formatações são transmitidas do Google Doc para o blog.</p>\n<p>Como foi feito?</p>\n<p>Um código hospedado no Google Script faz a conversão. Ele opera todo dia, de madrugada, nesta primeira versão.</p>\n<p>Como o mundo do javascript no servidor é poderoso, mesmo ainda nesta primeira versão o Google Blog consegue:</p>\n<h3>Revisar o texto</h3>\n<p>Se o autor pedir nas configurações do blog, o Google Blog revisa o texto automaticamente usando IA.</p>\n<h3>Criar uma hero image</h3>\n<p>Todo Google Blog cria uma hero image - aquela imagem que fica no topo, antes de começar o texto do blog - quando não há uma imagem inserida no topo do Google Doc.</p>\n<p>Por exemplo, a hero image (imagem do topo) do Google Doc “Um Blog Fácil” foi gerada por IA, automaticamente.</p>\n<figure><img src=\"https://raw.githubusercontent.com/vladimirbrasil/vladidevprojects/main/images/google-blogs-image-2.jpg\" alt=\"\" /></figure>\n<h3>Traduzir</h3>\n<p>Sempre que o Google Doc contiver a indicação “versão em inglês”, “versão em [qualquer idioma]” em qualquer parte do texto, o blog será gerado nestes outros idiomas, também. Cada idioma tendo seu index separado.</p>\n<p>Por exemplo, aqui está o índice para entradas <a href=\"https://blog.vladi.dev/de/index.html\" target=\"_blank\" rel=\"noopener noreferrer\">em alemão de meu blog</a>. Aqui temos “Um Blog Fácil” <a href=\"https://blog.vladi.dev/fr/articles/um-blog-facil.html\" target=\"_blank\" rel=\"noopener noreferrer\">em francês</a>. Tudo gerado automaticamente por IA. </p>\n<h3>Comprimir imagens</h3>\n<p>Por que não comprimir as imagens antes de publicá-las? Claro que sim, automaticamente. As imagens são comprimidas antes de irem para o blog.</p>\n<h2>Liberdade simples</h2>\n<p>E assim consegui liberdade para criar entradas em meu blog, com a simplicidade de uma das ferramentas mais fáceis para gerar conteúdo: um Google Doc.</p>\n<p>“Google Blogs”, apelidei.</p>\n<p>Tudo é feito a partir de uma pasta do meu Google Drive, que contém meus Google Docs.</p>\n<p>Simples assim.</p>\n<p>Para mim, hoje, esta é a maneira mais simples de gerar um blog. Sem as restrições que encontrei nas primeiras opções, como Medium e Meta.</p>\n<p>Bons textos e boas leituras a todos!</p>\n<p>---</p>\n<p>Obs.: notaram que aproveitei a mesma tecnologia para meus projetos? Eles também usam a mesma ferramenta que cria blogs. Assim, a postagem sobre este projeto também não passa de um Google Blog: um Google Doc mais o poder do javascript no servidor. </p>\n<figure><img src=\"https://raw.githubusercontent.com/vladimirbrasil/vladidevprojects/main/images/google-blogs-image-3.jpg\" alt=\"Google Doc that generated the post about this project (my native language is Portuguese, so the text in the image is in Portuguese)\" /></figure>\n",
  "images": [
    {
      "fileName": "google-blogs-image-1.jpg",
      "githubPath": "images/google-blogs-image-1.jpg",
      "githubUrl": "https://raw.githubusercontent.com/vladimirbrasil/vladidevprojects/main/images/google-blogs-image-1.jpg",
      "altText": "",
      "caption": ""
    },
    {
      "fileName": "google-blogs-image-2.jpg",
      "githubPath": "images/google-blogs-image-2.jpg",
      "githubUrl": "https://raw.githubusercontent.com/vladimirbrasil/vladidevprojects/main/images/google-blogs-image-2.jpg",
      "altText": "",
      "caption": ""
    },
    {
      "fileName": "google-blogs-image-3.jpg",
      "githubPath": "images/google-blogs-image-3.jpg",
      "githubUrl": "https://raw.githubusercontent.com/vladimirbrasil/vladidevprojects/main/images/google-blogs-image-3.jpg",
      "altText": "Google Doc that generated the post about this project (my native language is Portuguese, so the text in the image is in Portuguese)",
      "caption": "Google Doc that generated the post about this project (my native language is Portuguese, so the text in the image is in Portuguese)"
    }
  ],
  "contentHash": "264f7d675250d6e767e7979d305"
}