{
  "id": "nao-incomode-o-funcionario",
  "title": "Não Incomode o Funcionário",
  "author": "Vladimir Dietrich",
  "date": "2025-07-08",
  "readingTime": 4,
  "heroImage": {
    "fileName": "nao-incomode-o-funcionario-image-0.jpg",
    "githubPath": "images/nao-incomode-o-funcionario-image-0.jpg",
    "githubUrl": "https://raw.githubusercontent.com/vladimirbrasil/vladidevprojects/main/images/nao-incomode-o-funcionario-image-0.jpg",
    "altText": "",
    "caption": ""
  },
  "lastUpdated": "2025-09-03T14:50:14.594Z",
  "wordCount": 885,
  "content": "<p>   </p>\n<p>Recebi uma demanda por estatísticas no ambiente de trabalho.</p>\n<p>Uma planilha Excel com dados relevantes.</p>\n<p>Como alimentamos este Excel?</p>\n<p>Quem me pediu mais estatísticas é um exímio anotador de dados: ele mesmo tem uma planilha dele, com lindas anotações sobre tudo que faz.</p>\n<p>Em sua planilha os percentuais medem variados tipos de métricas de eficiência, colorindo com clareza a tela do computador.</p>\n<p>Como convencer os demais funcionários a também serem excelentes anotadores de dados para fins estatísticos?</p>\n<p>Em nossa conversa, usei a abordagem cética sobre preenchimento de dados: mesmo criando lindos formulários, quem garantiria que todos funcionários irão preencher, sempre, os números relevantes para montar uma estatística para todo o setor?</p>\n<p>Minha visão cética respondeu: ninguém garante. Ao contrário, é quase certo que alguém não preencherá algum dado algum dia, ou muitos funcionários, muitos dados, principalmente com o passar de muito tempo. Após alguns anos, então, a chance do esforço adicional não acontecer total ou parcialmente é quase 100%, </p>\n<p>Estávamos neste impasse: a estatística faz muita falta, e precisa ser para todo o  setor. Não podemos ficar com a dúvida se alguém não preencheu algo, ao divulgar a estatística de todo o setor.</p>\n<p>Uma demanda paralela era a rastreabilidade de documentos: precisávamos pesquisar rapidamente documentos, e poderíamos usar as planilhas que geram estatísticas também para pesquisar por números de documentos. </p>\n<p>Aqui o problema da adesão incerta fica ainda maior: se ficar a dúvida se um único funcionário não preencheu a planilha, como poderemos dizer que não encontramos o documento se não temos certeza se todos os funcionários preenchem a planilha, sempre?</p>\n<p>Deixamos nossos cérebros esquentarem um pouco, sinapses trabalhando.</p>\n<p>Apareceu uma solução que considero não só elegante e funcional, mas também delicada, respeitosa, que não incomoda ninguém, realmente automatizada.</p>\n<p>Este setor só possui uma certeza, em toda sua linha de produção: ao final, um laudo será produzido. </p>\n<p>Como o laudo é feito, se preenche ou não planilhas ou formulários paralelos, em quanto tempo, usando quais recursos, nada disso é certo. Há uma liberdade em como produzir pois trata-se de uma área que requer inteligência, análise, em que cada funcionário possui seu método para chegar ao resultado final.</p>\n<p>O resultado final, porém, é certo: um laudo. Em pdf.</p>\n<p>Pode ter sido produzido via Word, via Google Doc, via qualquer maneira. Mas será, ao final de tudo, um belo laudo em pdf.</p>\n<p>Pronto então: vamos adquirir uma máquina de não mais do que mil dólares, com farta memória RAM, uma boa placa de vídeo NVIDIA e uma boa CPU para rodar localmente uma inteligência artificial - só para manter os laudos fora da web. Sim, seria fácil implementar, neste caso em qualquer máquina simples, uma consulta a uma inteligência artificial via API. Mas optamos pela inteligência artificial local.</p>\n<p>Um script python monitora a pasta da rede que recebe todos os laudos em PDF prontos do setor.</p>\n<p>Ao aparecer um novo laudo, a inteligência artificial extrai os campos que precisamos para montar estatísticas. </p>\n<p>Como a maneira de redigir laudos varia bastante, optei por não usar regex, nem tentar.</p>\n<p>Confesso que seria possível adaptar um bom regex à variação de maneiras de escrever laudos, mas na verdade eu quis outra vantagem; a escalabilidade em dois aspectos:</p>\n<li>Não precisar adaptar, ou precisar adaptar menos o código a cada novo funcionário entrante. Isto permite que o código dure anos ou décadas, sem precisar de grandes ajustes.</li>\n<li>Quero que o time de funcionários possa adicionar novas estatísticas sem depender de um super especialista em regex, usualmente bastando adicionar a nova pergunta na consulta à inteligência artificial que, então, adiciona a nova informação a uma nova coluna na planilha. Liberdade para inovar rapidamente! ☀️</li>\n<p>A solução é mais poderosa do que imaginávamos ao deparar o problema inicial. Com.esta solução, até mesmo um relacionamento um-para-muitos foi implementado pela pela primeira vez no setor. Como a inteligência artificial retorna um array (um set, para remover duplicados) quando há muitas coisas do mesmo tipo para responder, agora estamos montando estatísticas e maneiras de encontrar rápido itens que acontecem em quantidades indefinidas, para cada laudo.</p>\n<p>Neste caso, criamos uma nova aba na planilha e adicionamos todos os itens do array retornado pela inteligência artificial ao lado do valor único que determina a qual linha da tabela principal estes itens pertencem.</p>\n<p>Um.destes itens é muito procurado por quem pede informações ao setor, então está inovação vai agilizar o processo de todo o setor e de quem consulta o setor.</p>\n<p>Claro, poderíamos usar um banco de dados SQL, ou outro tipo; poderíamos usar planilhas do Google, variadas opções.</p>\n<p>Preferi manter aquilo que os funcionários estão acostumados a ver no dia a dia.</p>\n<p>Este tipo de solução me deixa tão contente, sabe por quê? </p>\n<p>Porque os funcionários nem perceberão a solução já acontecendo.</p>\n<p>Não mudarão em nada suas vidas.</p>\n<p>Se quiserem mudar, um dia, sei que há um setor de recursos humanos, ou eles mesmos podem se reunir e mudar.</p>\n<p>Mas não sou eu, admirador de tecnologias, que vou pedir para um funcionário ou todo um setor mudar.</p>\n<p>Se posso ser discreto como uma joaninha que pousa no lugar, ninguém vê, leve, mas traz muita sorte - ou estatísticas e rastreabilidade - quero ser a joaninha que ninguém percebe!</p>\n<p>Ótimo dia a todos! ☀️☀️☀️☀️</p>\n",
  "images": [],
  "contentHash": "752846063128809069d0c423"
}